In [1]:
import numpy as np
import pandas as pd

In [2]:
# dictionary of lists 
data_dict = {'First':[100, 90, np.nan, 95], 
        'Second': [30, 45, 56, np.nan], 
        'Third':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
data_df = pd.DataFrame(data_dict)

In [3]:
data_df.head()

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0